{
  "pages": {
    "index": {
      "title": "Barringtons - Independent Funeral Services Liverpool | 24 Hour Support",
      "description": "Family-run funeral directors serving Liverpool for over 100 years. Compassionate, personal service available 24/7. Waterloo, Formby & Netherton locations. Call 0151 928 1625.",
      "keywords": "funeral directors Liverpool, independent funeral services, family funeral directors Merseyside, 24 hour funeral support, Barringtons funerals"
    },
    "about-us": {
      "title": "About Barringtons - Family Funeral Directors Since 1902 | Liverpool",
      "description": "Four generations of caring funeral service in Liverpool. Led by David Barrington (NAFD President 2019-2021). Over 3000 memorial trees planted. Trusted, independent & compassionate.",
      "keywords": "family funeral directors Liverpool, independent funeral directors Merseyside, NAFD funeral directors, David Barrington, established funeral services"
    },
    "immediate-need": {
      "title": "Immediate Need Funeral Services Liverpool | 24 Hour Emergency Support",
      "description": "Immediate funeral support when you need it most. Our caring team is available 24/7 to guide you through every step. Call 0151 928 1625 for urgent assistance in Liverpool.",
      "keywords": "immediate need funeral Liverpool, emergency funeral services, 24 hour funeral directors, urgent funeral arrangements Merseyside"
    },
    "when-a-death-occurs": {
      "title": "What To Do When Someone Dies | Funeral Guide Liverpool",
      "description": "Practical guidance on first steps after a death. From registering the death to arranging the funeral, our comprehensive guide helps Liverpool families through difficult times.",
      "keywords": "what to do when someone dies Liverpool, death registration, funeral arrangement steps, bereavement support Merseyside"
    },
    "planning-ahead": {
      "title": "Funeral Plans Liverpool | Pre-Paid Plans from Barringtons",
      "description": "Plan ahead with confidence. Pre-paid funeral plans tailored to your wishes and budget. Peace of mind for you and your family. Free consultation available in Liverpool.",
      "keywords": "funeral plans Liverpool, pre-paid funeral plans Merseyside, advance funeral planning, funeral plan costs"
    },
    "standardised-price-list-CORRECTED": {
      "title": "Funeral Prices Liverpool | Transparent Pricing from £995",
      "description": "Clear, transparent funeral pricing with no hidden costs. View our standardised price list for cremations, burials and all funeral services. Affordable options available.",
      "keywords": "funeral costs Liverpool, funeral prices Merseyside, cremation costs, burial prices, transparent funeral pricing"
    },
    "services-overview": {
      "title": "Funeral Services Liverpool | Traditional, Green & Direct Cremation",
      "description": "Comprehensive funeral services including traditional burials, cremations, green funerals and direct cremation. Personalised services to celebrate your loved one's life.",
      "keywords": "funeral services Liverpool, cremation services, burial services Merseyside, green funerals, direct cremation"
    },
    "coffins": {
      "title": "Coffins & Caskets Liverpool | Traditional to Eco-Friendly Options",
      "description": "Wide selection of coffins and caskets from traditional solid wood to eco-friendly wicker and cardboard. Personalisation available. View our range with transparent pricing.",
      "keywords": "coffins Liverpool, caskets, eco coffins Merseyside, traditional coffins, biodegradable coffins"
    },
    "personalisation": {
      "title": "Funeral Personalisation Liverpool | Create Unique Tributes",
      "description": "Make the funeral unique with personalised tributes, themed services, custom coffin designs and special touches that celebrate your loved one's life and personality.",
      "keywords": "personalised funerals Liverpool, funeral personalisation, unique funeral tributes, memorial personalisation Merseyside"
    },
    "transport": {
      "title": "Funeral Transport Liverpool | Hearse & Limousine Hire",
      "description": "Traditional and alternative funeral transport including hearses, limousines, horse-drawn carriages and motorcycle hearses. Professional chauffeurs and pristine vehicles.",
      "keywords": "funeral cars Liverpool, hearse hire, funeral limousines Merseyside, funeral transport, horse drawn hearse"
    },
    "pet-products": {
      "title": "Pet Cremation Liverpool | Memorial Products for Beloved Pets",
      "description": "Compassionate pet funeral services including cremation, caskets and memorial keepsakes. Helping Liverpool families say goodbye to beloved pets with dignity.",
      "keywords": "pet cremation Liverpool, pet funeral services, pet memorial products Merseyside, pet caskets"
    },
    "frequently-asked-questions": {
      "title": "Funeral FAQs | Common Questions About Funeral Services",
      "description": "Answers to common funeral questions including costs, timings, documentation and etiquette. Helpful guidance from Liverpool's trusted funeral directors.",
      "keywords": "funeral questions Liverpool, funeral FAQs, funeral advice, bereavement questions"
    },
    "etiquette": {
      "title": "Funeral Etiquette Guide | What to Wear, Say & Do",
      "description": "Complete guide to funeral etiquette including dress codes, appropriate behavior, condolence messages and flower etiquette. Respectful guidance for attending funerals.",
      "keywords": "funeral etiquette UK, funeral dress code, what to say at funeral, funeral behavior guide"
    },
    "social-security-benefits": {
      "title": "Bereavement Benefits UK | DWP Funeral Payment & Support",
      "description": "Guide to claiming bereavement benefits including DWP funeral payments, bereavement support payment and widowed parent's allowance. Eligibility and application help.",
      "keywords": "bereavement benefits UK, funeral payment DWP, widows pension Liverpool, death benefits"
    },
    "helpful-links": {
      "title": "Bereavement Support Liverpool | Useful Resources & Links",
      "description": "Directory of helpful bereavement resources including grief counselling, support groups, council services and charities in Liverpool and Merseyside area.",
      "keywords": "bereavement support Liverpool, grief support resources, funeral resources, bereavement help Merseyside"
    },
    "muchloved-tributes": {
      "title": "Online Memorial Tributes | MuchLoved Memorial Pages Liverpool",
      "description": "Create lasting online tributes with MuchLoved memorial pages. Share memories, photos and collect donations in memory of your loved one. Free to set up.",
      "keywords": "online memorial Liverpool, MuchLoved tributes, online obituaries, memorial websites"
    },
    "funeral-notices": {
      "title": "Funeral Notices Liverpool | Recent Deaths & Service Times",
      "description": "Latest funeral notices and death announcements for Liverpool and Merseyside. Service times, obituaries and tribute information for recent bereavements.",
      "keywords": "funeral notices Liverpool, death notices, Liverpool obituaries today, recent deaths Liverpool"
    },
    "our-location": {
      "title": "Funeral Directors Waterloo, Formby & Netherton | Find Us",
      "description": "Three convenient locations across Liverpool. Main office in Waterloo (24 hours), plus Formby and Netherton branches. Directions, parking and accessibility information.",
      "keywords": "funeral directors Waterloo, funeral directors Formby, funeral directors Netherton, funeral directors near me"
    },
    "our-facilities": {
      "title": "Funeral Home Facilities Liverpool | Chapel of Rest & Service Rooms",
      "description": "Modern, peaceful facilities including private chapel of rest, viewing rooms and service chapel. Disabled access, parking and comfortable surroundings for families.",
      "keywords": "funeral home facilities Liverpool, chapel of rest, funeral parlour Waterloo, viewing room"
    }
  },
  "meta_guidelines": {
    "title_length": "50-60 characters",
    "description_length": "150-160 characters",
    "keyword_density": "2-3% for primary keywords",
    "local_seo_focus": "Include Liverpool/Merseyside in key pages",
    "call_to_action": "Include phone number on urgent/commercial pages",
    "trust_signals": "Mention family-run, established dates, accreditations"
  }
}